# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-01-15 14:52:07 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TAGS: web(w)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Snoopy [1/3]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  Snoopy is a naive desktop search engine for your files. It aims to be gentle
  on resource usage, index both file names, types, and metadata/content where
  feasible.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-01-15 Mi 14:52]
   | Headline                        | Time      |           |       |      |
   |---------------------------------+-----------+-----------+-------+------|
   | *Total time*                    | *2d 6:07* |           |       |      |
   |---------------------------------+-----------+-----------+-------+------|
   | *Snoopy [1/3]*                  | *2d 6:07* |           |       |      |
   | \_  /Components [1/3]/          |           | /2d 6:07/ |       |      |
   | \_    Data model [0/0]          |           |           |  0:37 |      |
   | \_    Database [1/3]            |           |           |  8:55 |      |
   | \_      Relative paths          |           |           |       | 2:09 |
   | \_    Blacklist [0/0]           |           |           |  2:51 |      |
   | \_    Walker [0/0]              |           |           | 10:48 |      |
   | \_    Extractor [0/0]           |           |           | 14:57 |      |
   | \_    UI [0/1]                  |           |           | 15:59 |      |
   | \_      Edit Blacklist from GUI |           |           |       | 0:43 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [1/3]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Data model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-12-22 So 15:33]--[2024-12-22 So 16:10] =>  0:37
    :END:
*** Database [1/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-13 Mo 15:17]--[2025-01-13 Mo 15:25] =>  0:08
    CLOCK: [2025-01-12 So 10:31]--[2025-01-12 So 11:01] =>  0:30
    CLOCK: [2025-01-11 Sa 17:55]--[2025-01-11 Sa 18:13] =>  0:18
    CLOCK: [2025-01-10 Fr 22:04]--[2025-01-11 Sa 00:41] =>  2:37
    CLOCK: [2025-01-07 Di 11:58]--[2025-01-07 Di 12:18] =>  0:20
    CLOCK: [2024-12-27 Fr 17:40]--[2024-12-27 Fr 18:13] =>  0:33
    CLOCK: [2024-12-27 Fr 17:02]--[2024-12-27 Fr 17:28] =>  0:26
    CLOCK: [2024-12-25 Mi 17:26]--[2024-12-25 Mi 18:09] =>  0:43
    CLOCK: [2024-12-23 Mo 20:31]--[2024-12-23 Mo 21:42] =>  1:11
    :END:
    I'm gonna use SQLite, it's just too obvious a choice.
**** TODO Prune
     Would be nice to remove Files that no longer exist, as well as their
     associated metadata.
**** TODO Global connection pool
     It's just the logical conclusion
**** CANCELLED Relative paths
     CLOSED: [2024-12-30 Mo 20:22]
     :LOGBOOK:
     CLOCK: [2024-12-30 Mo 18:13]--[2024-12-30 Mo 20:22] =>  2:09
     :END:
     I am not sure if this has enough impact to matter, but I could save some
     disk space if I stored the paths of Files only relative to their root
     directories.
     [2024-12-30 Mo 20:38]
     It is more trouble than it's worth.
*** Blacklist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-07 Di 11:06]--[2025-01-07 Di 11:25] =>  0:19
    CLOCK: [2025-01-06 Mo 18:03]--[2025-01-06 Mo 19:00] =>  0:57
    CLOCK: [2024-12-27 Fr 19:15]--[2024-12-27 Fr 19:19] =>  0:04
    CLOCK: [2024-12-23 Mo 18:55]--[2024-12-23 Mo 19:56] =>  1:01
    CLOCK: [2024-12-22 So 16:10]--[2024-12-22 So 16:40] =>  0:30
    :END:
*** Walker [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-07 Di 18:43]--[2025-01-07 Di 20:49] =>  2:06
    CLOCK: [2025-01-06 Mo 16:51]--[2025-01-06 Mo 17:41] =>  0:50
    CLOCK: [2024-12-28 Sa 14:44]--[2024-12-28 Sa 18:50] =>  4:06
    CLOCK: [2024-12-27 Fr 19:21]--[2024-12-27 Fr 22:42] =>  3:21
    CLOCK: [2024-12-23 Mo 20:05]--[2024-12-23 Mo 20:30] =>  0:25
    :END:
    How / when do I want to run the Walker? Periodically? On command?
    I think on command is sufficient for now, I can add some periodic
    execution later on.
*** Extractor [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-15 Mi 13:09]--[2025-01-15 Mi 14:52] =>  1:43
    CLOCK: [2025-01-15 Mi 08:20]--[2025-01-15 Mi 09:41] =>  1:21
    CLOCK: [2025-01-14 Di 17:42]--[2025-01-14 Di 19:08] =>  1:26
    CLOCK: [2025-01-14 Di 05:21]--[2025-01-14 Di 07:29] =>  2:08
    CLOCK: [2025-01-13 Mo 15:26]--[2025-01-13 Mo 15:50] =>  0:24
    CLOCK: [2025-01-13 Mo 14:39]--[2025-01-13 Mo 15:17] =>  0:38
    CLOCK: [2025-01-11 Sa 16:59]--[2025-01-11 Sa 17:55] =>  0:56
    CLOCK: [2025-01-10 Fr 20:43]--[2025-01-10 Fr 20:43] =>  0:00
    CLOCK: [2025-01-10 Fr 18:11]--[2025-01-10 Fr 19:30] =>  1:19
    CLOCK: [2025-01-10 Fr 17:54]--[2025-01-10 Fr 17:55] =>  0:01
    CLOCK: [2025-01-08 Mi 18:12]--[2025-01-08 Mi 22:57] =>  4:45
    CLOCK: [2025-01-08 Mi 17:50]--[2025-01-08 Mi 18:06] =>  0:16
    :END:
    The extractor attempts to get as much usable metadata and/or file content
    to index as possible.

    I am not entirely sure yet how I want to represent the data I get. I am
    thinking I might want to have some sort of structure beyond just a chunk
    of text. I'm thinking JSON? I have been meaning to play with SQLite's JSON
    handling, this could be a good opportunity to get acquainted with it.
**** Miming
     Running my application on a few representative directory trees, I get the
     following distribution of MIME types:
     | Type                                           | Count |
     | image/jpeg                                     |  8770 |
     | image/png                                      |  2444 |
     | application/json                               |  1250 |
     | image/gif                                      |   293 |
     | text/plain; charset=utf-8                      |   260 |
     | application/octet-stream                       |   191 |
     | application/pdf                                |   113 |
     | video/mp4                                      |    39 |
     | application/epub+zip                           |    26 |
     | image/tiff                                     |    13 |
     | image/webp                                     |    12 |
     | application/vnd.oasis.opendocument.text        |    10 |
     | application/gzip                               |     7 |
     | text/x-python                                  |     6 |
     | text/x-perl                                    |     5 |
     | text/tab-separated-values                      |     5 |
     | image/x-xcf                                    |     5 |
     | audio/mpeg                                     |     5 |
     | application/zstd                               |     5 |
     | application/vnd.oasis.opendocument.spreadsheet |     5 |
     | text/html; charset=utf-8                       |     4 |
     | image/svg+xml                                  |     4 |
     | audio/ogg                                      |     4 |
     | application/vnd.sqlite3                        |     4 |
     | application/x-bzip2                            |     3 |
     | text/plain                                     |     2 |
     | image/bmp                                      |     2 |
     | application/x-xz                               |     2 |
     | video/x-matroska                               |     1 |
     | video/webm                                     |     1 |
     | text/xml; charset=utf-8                        |     1 |
     | text/x-lua                                     |     1 |
     | text/plain; charset=iso-8859-1                 |     1 |
     | text/csv                                       |     1 |
     | image/x-icon                                   |     1 |
     | image/heif                                     |     1 |
     | image/avif                                     |     1 |
     | audio/mp4                                      |     1 |
     | application/zip                                |     1 |
     |------------------------------------------------+-------|

*** UI [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-13 Mo 17:41]--[2025-01-13 Mo 18:17] =>  0:36
    CLOCK: [2025-01-04 Sa 14:46]--[2025-01-04 Sa 17:34] =>  2:48
    CLOCK: [2025-01-04 Sa 14:07]--[2025-01-04 Sa 14:46] =>  0:39
    CLOCK: [2025-01-03 Fr 18:40]--[2025-01-03 Fr 23:03] =>  4:23
    CLOCK: [2025-01-02 Do 18:49]--[2025-01-02 Do 22:42] =>  3:53
    CLOCK: [2024-12-31 Di 17:41]--[2024-12-31 Di 20:04] =>  2:23
    CLOCK: [2024-12-30 Mo 20:56]--[2024-12-30 Mo 21:30] =>  0:34
    :END:
    I think I am going to have two panels (notebooks), one for the Roots and
    the respective files, and the second one for searching.
**** TODO Edit Blacklist from GUI
     :LOGBOOK:
     CLOCK: [2025-01-07 Di 17:53]--[2025-01-07 Di 18:36] =>  0:43
     :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
